using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace Mechanics.Paths
{
    //Інтерфейс для шляху. Все що він заставляє нас реалізовувати пізніше - це метод, який визначає напрямок руху в точці знаходження
    public interface IPath
    {
        //Як ви можливо знаєте, інтерфейси в C# дають можливість тільки оголосити методи та властивості. Класи, які їх реалізовують, визначають, що ці методи роблять.
        //І чим хороші інтерфейси, так це тим, що один клас може реалізувати багато інтерфейсів.
        //При цьому обєкти цього класу можна розглядати як обєкти інтерфейсу, який їх реалізовує, не знаючи що це за клас і працюючи тільки з методами, які його інтерфейс надає.
        Vector3 DirectionOnPoint(Vector3 point);

        Vector3 ClampPosition(Vector3 point);
    }
}